// General
"Chameleon_title" = "Chameleon Bootloader";
"Chameleon_description" = "Chameleon requires three essential files. (in simple terms)
boot0 (On the drive's MBR) responsible for loading boot1.
boot1 (On the partition's boot-sector) to finding boot2.
boot2 (On the partition's root directory) for loading kernel etc.";

"Standard_title" = "Chameleon Standard";
"Standard_description" = "Installation Standard de Chameleon !";

"EFI_title" = "EFI";
"EFI_description" = "Install Chameleon's files to the normally hidden EFI partition using either boot0 or boot0md depending on your system and without destroying any existing Windows installation if you have one.";

"noboot_title" = "Don't install the Bootloader";
"noboot_description" = "Useful if you only want to install the extra's.";

// Modules

"Module_title" = "Chameleon Modules";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file. ";

"AMDGraphicsEnabler_title" = "AMDGraphicsEnabler";
"AMDGraphicsEnabler_description" = "";

"ATiGraphicsEnabler_title" = "ATiGraphicsEnabler";
"ATiGraphicsEnabler_description" = "";

"IntelGraphicsEnabler_title" = "IntelGraphicsEnabler";
"IntelGraphicsEnabler_description" = "";

"klibc_title" = "klibc";
"klibc_description" = "This module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "This module reads the edid information from the monitor attached to the main display.
The module is currently not integrated into trunk and has minimal uses as it stands.
Additionally, the module will patch the vesa modes available in pre intel hd graphics cards to provide proper resolution while booting.";

"NVIDIAGraphicsEnabler_title" = "NVIDIAGraphicsEnabler";
"NVIDIAGraphicsEnabler_description" = "";

"uClibc_title" = "uClibc++";
"uClibc_description" = "This module provides a minimalistic c++ runtime library for use in other modules.
This does not provide functionality by itself, instead it is used to allow for the c++ language to be used in other modules.
Please note that rtti and exceptions has both been disabled.
Source: http://cxx.uclibc.org/
Dependencies: klibc";

// Utility
"Utility_title" = "Utilities";
"Utility_description" = "Optional files to help setup";

"PrefPanel_title" = "Preference Panel";
"PrefPanel_description" = "Installs Preference Panel for Chameleon.";

"SMBIOSDefault_title" = "SMBIOS.plist";
"SMBIOSDefault_description" = "Copies an example smbios.plist in /Extra/Configuration.";

"Documentation_title" = "Documentation";
"Documentation_description" = "Documentation for Chameleon manual install and use";

// Options
"Options_title" = "Options";
"Options_description" = "Create an /Extra/org.chameleon.Boot.plist and select your desired options to control Chameleon's settings.";

"arch_title" = "arch=i386";
"arch_description" = "Boots the kernel in 32bit mode rather than the default 64bit mode.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Display the partition selection screen without showing the timeout screen.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Enable quiet boot mode (no messages or prompt).";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Disables the automatically enabled restart fix.";

"ShowInfo_title" = "ShowInfo=No";
"ShowInfo_description" = "Disables display of partition and resolution details.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Discard the motherboard's built-in SSDT tables.";

"EthernetBuiltIn_title" = "EthernetBuiltIn";
"EthernetBuiltIn_description" = "ajoute EthernetBuiltIn=y au fichier com.apple.Boot.plist, cette option ajoutera 'built-in' a votre carte ethernet.";

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Enables the option to autodetect NVIDIA based GPUs and inject the correct info.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Enable C2State";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Enable C3State";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Enable C4State";
// Advanced
"Advanced_title" = "Advanced";
"Advanced_description" = "Select your advanced desired options to control Chameleon's settings.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Set the flag npci=0x2000 for the Kernel Flags";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Hides Chameleon's boot banner in GUI.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Use the legacy (grey on white) apple logo on the boot screen rather than the boot.png in the theme.";

"SMBIOSdefaults_title" = "SMBIOSdefaults=Yes";
"SMBIOSdefaults_description" = "Enables SMBIOSdefaults options.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Enables UseAtiROM options.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Enables UseNvidiaROM options.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Pauses the boot process after Chameleon has finished it's setup then waits for a key press before it starts the mach kernel. Useful when combined with verbose boot for troubleshooting.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Attempts to load the sleep image saved from last hibernation.";

"GUI_title" = "GUI";
"GUI_description" = "Désactive l'interface graphique.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Enables VBIOS option";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Enable automatically generated processor C-States.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Enable automatically generated processor P-States.";

"CSTUsingSystemIO_title" = "New - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "New C-State _CST generation method using SystemIO registers instead of FixedHW.";

"ForceHPET_title" = "ForceHPET";
"ForceHPET_description" = "ajoute ForceHPET=y to com.apple.Boot.plist, Cette option active HPET sur les chipsets intel,(pour les bios qui n'ont pas cette options).";

"ForceWake_title" = "ForceWake";
"ForceWake_description" = "réveille forcé, (ajoute l'option ForceWake=y au fichier com.apple.Boot.plist)";

"EHCIacquire_title" = "EHCIacquire";
"EHCIacquire_description" = "fixe certains problème de branchement usb a chaud et de reconnaissance usb2 !";

"UHCIreset_title" = "UHCIreset";
"UHCIreset_description" = "fixe quelques rares problèmes de detection usb";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Disables the automatically enabled RAM recognition.";

// Resolution
"Resolution_title" = "Resolution";
"Resolution_description" = "Set the screen resolution of your display";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "1024x768x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "1280x960x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "1920x1200x32";

// Themes
"Themes_title" = "Themes";
"Themes_description" = "Une collection de themes samplé
More themes can be found at http://forum.voodooprojects.org/index.php/board,7.0.html";

"Embed_title" = "Embed";
"Embed_description" = "A smaller simple version of the new default theme used when building a version of Chameleon which requires an embedded theme. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Chameleon's previous default theme";

"Default_title" = "Standard";
"Default_description" = "Ce theme est codé directement dans le fichier Boot, inclu ici pour vous comme base de customisation.";

// Extras
"Extras_title" = "Extras";
"Extras_description" = "une collection d'addons utiles";

"SMBios_title" = "SMBIOS Override";
"SMBios_description" = "Installe le fichier de configuration SMBIOS smbios.plist into Extra";

// Error strings
"ERROR_BOOTVOL" = "Ce logiciel doit etre installé sur le volume de démarrage";
"ERROR_INSTALL" = "ce volume ne réunit pas les conditions requises por cette mise à jour.";

"Newer_Package_Installed_message" = "Une version plus récente de chameleon est déja installée";
"Intel_Mac_message" = "Ce logiciel ne peux etre installé sur cet ordinateur.";
